In [1]:
import pandas as pd
import os
import random
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
group_info = pd.read_csv('group_info_OnlyLastAuthorPaper.csv')

In [3]:
group_info.head(5)

,work_id,author_position,author_id,institution_id,publication_year,first_pub_year,scientific_age,group_size,mentor_id,current_year,ratio_institution,last_pub_year,career_len,mentor_first_pub_year,mentor_scientific_age
0,W1977009494,first,A2065840449,I79817857,1996,1996,0,1,A2159931953,1996,1.0,2015.0,19.0,1993,3
1,W1977009494,first,A2065840449,I79817857,1996,1996,0,1,A2159931953,1997,1.0,2015.0,19.0,1993,4
2,W1977009494,first,A2065840449,I79817857,1996,1996,0,2,A2159931953,1998,1.0,2015.0,19.0,1993,5
3,W2032668235,first,A2677772339,I79817857,1998,1998,0,2,A2159931953,1998,1.0,1998.0,0.0,1993,5
4,W1977009494,first,A2065840449,I79817857,1996,1996,0,2,A2159931953,1999,1.0,2015.0,19.0,1993,6

#### Find Mentee's performance

pub_num

total_cits

yearly_cits

fecundity

career length

In [4]:
all_mentee = group_info.author_id.drop_duplicates().tolist()

In [5]:
print('num_of_mentee: ',len(all_mentee))

num_of_mentee:  670770

##### find mentee's work

In [6]:
from sqlalchemy import create_engine
engine = create_engine("mysql+pymysql://{user}:{pw}@{host}:{port}/{db}?charset=utf8mb4"
                       .format(user="openalex_ym",
                               pw="openalex.ym",
                               host="172.18.18.167",
                               port=3306,
                               db="openalex2022"),
                       )

In [7]:
mentee_groups = []
interval = 5000
start_point = 0
while True:
    end_point = start_point + interval
    try:
        temp = all_mentee[start_point:end_point]
        mentee_groups.append(temp)
    except:
        temp = all_mentee[start_point:]
        mentee_groups.append(temp)
        
    start_point = end_point
    if end_point>len(all_mentee):
        break

In [8]:
print(len(mentee_groups))

135

In [9]:
l = len(mentee_groups)
print(l)
for i in range(l):
    temp =  mentee_groups[i]
    sql_query = """select works_authorships.work_id, works_authorships.author_id

                    from works_authorships 

                    where works_authorships.author_id in {}
                    """.format(tuple(temp))


    data = pd.read_sql(sql_query, con=engine)
    # merge data
    if i==0:
        tp = data
    else:
        tp = pd.concat((tp,data))
    if i%10==0:
        print(i)

Data = tp

135
0
10
20
30
40
50
60
70
80
90
100
110
120
130

In [13]:
Data = Data.rename(columns={'id':'work_id'})

In [14]:
Data.head(5)

       work_id   author_id
0  W1998731205  A105266732
1  W2905418025  A105266732
2  W2954584004  A105266732
3  W2588602655  A105266732
4  W2587357650  A105266732

In [15]:
Data.to_csv('alex_mentee_work.csv',index=0)

##### Done

##### find work's performance

In [16]:
alex_mentee_work = Data

In [17]:
alex_mentee_work.head(5)

       work_id   author_id
0  W1998731205  A105266732
1  W2905418025  A105266732
2  W2954584004  A105266732
3  W2588602655  A105266732
4  W2587357650  A105266732

In [18]:
works = alex_mentee_work.work_id.drop_duplicates().tolist()

In [19]:
print(len(works))

7108094

In [20]:
works_groups = []
interval = 5000
start_point = 0
while True:
    end_point = start_point + interval
    try:
        temp = works[start_point:end_point]
        works_groups.append(temp)
    except:
        temp = works[start_point:]
        works_groups.append(temp)
        
    start_point = end_point
    if end_point>len(works):
        break

In [21]:
l = len(works_groups)
print(l)
for i in range(l):
    temp =  works_groups[i]
    sql_query = """select works_puby_cits_team_concepts_innovation.id, works_puby_cits_team_concepts_innovation.cits,works_puby_cits_team_concepts_innovation.cits5

                    from works_puby_cits_team_concepts_innovation 

                    where works_puby_cits_team_concepts_innovation.id in {}
                    """.format(tuple(temp))


    data = pd.read_sql(sql_query, con=engine)
    # merge data
    if i==0:
        tp = data
    else:
        tp = pd.concat((tp,data))
    if i%10==0:
        print(i)

Data = tp

1422
0
10
20
30
40
50
60
70
80
90
100
110
120
130
140
150
160
170
180
190
200
210
220
230
240
250
260
270
280
290
300
310
320
330
340
350
360
370
380
390
400
410
420
430
440
450
460
470
480
490
500
510
520
530
540
550
560
570
580
590
600
610
620
630
640
650
660
670
680
690
700
710
720
730
740
750
760
770
780
790
800
810
820
830
840
850
860
870
880
890
900
910
920
930
940
950
960
970
980
990
1000
1010
1020
1030
1040
1050
1060
1070
1080
1090
1100
1110
1120
1130
1140
1150
1160
1170
1180
1190
1200
1210
1220
1230
1240
1250
1260
1270
1280
1290
1300
1310
1320
1330
1340
1350
1360
1370
1380
1390
1400
1410
1420

In [22]:
Data.head(5)

            id   cits  cits5
0  W1003929037   58.0   12.0
1  W1006958873   41.0   10.0
2  W1009664936    2.0    1.0
3  W1011889563    3.0    1.0
4   W102281971  106.0   27.0

In [23]:
work_cits = Data

In [24]:
work_cits = work_cits.rename(columns={'id':'work_id'})

In [25]:
work_cits.head(5)

       work_id   cits  cits5
0  W1003929037   58.0   12.0
1  W1006958873   41.0   10.0
2  W1009664936    2.0    1.0
3  W1011889563    3.0    1.0
4   W102281971  106.0   27.0

In [26]:
alex_mentee_work.head(5)

       work_id   author_id
0  W1998731205  A105266732
1  W2905418025  A105266732
2  W2954584004  A105266732
3  W2588602655  A105266732
4  W2587357650  A105266732

In [27]:
alex_mentee_work_cits = alex_mentee_work.merge(work_cits,on='work_id',how='left')

In [28]:
alex_mentee_work_cits.head(5)

       work_id   author_id  cits  cits5
0  W1998731205  A105266732   0.0    0.0
1  W1998731205  A105266732   0.0    0.0
2  W2905418025  A105266732   8.0    5.0
3  W2954584004  A105266732   5.0    5.0
4  W2588602655  A105266732   0.0    0.0

In [29]:
total_cits = alex_mentee_work_cits.groupby('author_id')['cits'].agg('sum').reset_index(name='total_cits')

In [30]:
total_cits.head(5)

     author_id  total_cits
0   4224342845         0.0
1   4224342846         0.0
2  A1000090264       268.0
3   A100017777        25.0
4  A1000197587       712.0

In [31]:
total_cits5 = alex_mentee_work_cits.groupby('author_id')['cits5'].agg('sum').reset_index(name='total_cits5')

In [32]:
total_cits5.head(5)

     author_id  total_cits5
0   4224342845          0.0
1   4224342846          0.0
2  A1000090264        189.0
3   A100017777         14.0
4  A1000197587        592.0

In [33]:
cits = total_cits.merge(total_cits5,on='author_id',how='left')

In [34]:
cits.head(5)

     author_id  total_cits  total_cits5
0   4224342845         0.0          0.0
1   4224342846         0.0          0.0
2  A1000090264       268.0        189.0
3   A100017777        25.0         14.0
4  A1000197587       712.0        592.0

In [35]:
paper_num = alex_mentee_work.groupby('author_id')['work_id'].agg('count').reset_index(name='paper_num')

In [36]:
paper_num.head(5)

     author_id  paper_num
0   4224342845          1
1   4224342846          1
2  A1000090264         10
3   A100017777          2
4  A1000197587         20

In [37]:
cits = cits.merge(paper_num,how='left',on='author_id')

In [38]:
cits.head(5)

     author_id  total_cits  total_cits5  paper_num
0   4224342845         0.0          0.0          1
1   4224342846         0.0          0.0          1
2  A1000090264       268.0        189.0         10
3   A100017777        25.0         14.0          2
4  A1000197587       712.0        592.0         20

In [39]:
cits.shape

(670770, 4)

In [40]:
cits.to_csv('author_performance.csv',index=0)